app/controllers/categories_controller.rb

SELECT `categories`.* FROM `categories` ORDER BY lft ASC
---
  def manage
    @categories = Category.nested_set.all

SELECT `categories`.* FROM `categories` ORDER BY lft ASC
---
  def index
    @categories = Category.nested_set.all

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
---
  def show
    @category = Category.find(params[:id])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO `categories` (`created_at`, `depth`, `description`, `lft`, `parent_id`, `rgt`, `slug`, `title`, `updated_at`) VALUES ('2012-09-23 15:50:47', NULL, 'sdf gsdfgksdhfglksdghls', 1, NULL, 2, 'category-1', 'category 1', '2012-09-23 15:50:47')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 5 LIMIT 1
UPDATE `categories` SET `title` = 'testset1', `updated_at` = '2012-09-23 13:42:32' WHERE `categories`.`id` = 9
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 1
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy