app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`category_id`, `created_at`, `description`, `photo`, `slug`, `title`, `updated_at`) VALUES (3, '2012-09-23 11:58:47', 'gdsfg sdfgsdfg', '0001100.jpg', '', 'test', '2012-09-23 11:58:47')

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 1